In [2]:
print('Welcome to Pandas  !!!')

Welcome to Pandas  !!!

In [3]:
import pandas as pd

## To read file in your system

In [45]:
df = pd.read_csv(r'C:\Users\Yogi\Downloads\Salaries.csv')
print(df)

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

## To read an online data file

In [25]:
df = pd.read_csv("https://bitbucket.org/ntpl_sylvester/dataset/raw/467616310ddfaf8abbbbc13bdf1e32cdf0842cbd/Salaries.csv")
print(df)

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [14]:
df.describe()

             phd    service         salary
count  76.000000  78.000000      76.000000
mean   19.605263  15.051282  108003.355263
std    12.508215  12.139768   28525.350088
min     1.000000   0.000000   57800.000000
25%    10.000000   5.250000   87250.000000
50%    18.500000  14.500000  104671.000000
75%    27.250000  20.750000  127077.750000
max    56.000000  51.000000  186960.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
rank          78 non-null object
discipline    78 non-null object
phd           76 non-null float64
service       78 non-null int64
sex           78 non-null object
salary        76 non-null float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.8+ KB

In [65]:
df.ndim                                            # gives dimentions of data

2

In [69]:
df.shape

(78, 6)

In [70]:
df.size

468

In [17]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [71]:
df.head(10)

        rank discipline   phd  service   sex    salary
0       Prof          B  56.0       49  Male  186960.0
1       Prof          A  12.0        6  Male   93000.0
2       Prof          A  23.0       20  Male  110515.0
3       Prof          A  40.0       31  Male  131205.0
4       Prof          B  20.0       18  Male  104800.0
5       Prof          A  20.0       20  Male  122400.0
6  AssocProf          A  20.0       17  Male   81285.0
7       Prof          A  18.0       18  Male       NaN
8       Prof          A  29.0       19  Male   94350.0
9       Prof          A  51.0       51  Male   57800.0

In [16]:
df.tail()

         rank discipline   phd  service     sex    salary
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [72]:
df.tail(10)

         rank discipline   phd  service     sex    salary
68   AsstProf          A   4.0        2  Female   77500.0
69       Prof          A  28.0        7  Female  116450.0
70   AsstProf          A   8.0        3  Female   78500.0
71  AssocProf          B  12.0        9  Female   71065.0
72       Prof          B  24.0       15  Female  161101.0
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [73]:
df.index

RangeIndex(start=0, stop=78, step=1)

In [74]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [77]:
df.dtypes

rank           object
discipline     object
phd           float64
service         int64
sex            object
salary        float64
dtype: object

In [78]:
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [79]:
df.values

array([['Prof', 'B', 56.0, 49, 'Male', 186960.0],
       ['Prof', 'A', 12.0, 6, 'Male', 93000.0],
       ['Prof', 'A', 23.0, 20, 'Male', 110515.0],
       ['Prof', 'A', 40.0, 31, 'Male', 131205.0],
       ['Prof', 'B', 20.0, 18, 'Male', 104800.0],
       ['Prof', 'A', 20.0, 20, 'Male', 122400.0],
       ['AssocProf', 'A', 20.0, 17, 'Male', 81285.0],
       ['Prof', 'A', 18.0, 18, 'Male', nan],
       ['Prof', 'A', 29.0, 19, 'Male', 94350.0],
       ['Prof', 'A', 51.0, 51, 'Male', 57800.0],
       ['Prof', 'B', 39.0, 33, 'Male', 128250.0],
       ['Prof', 'B', 23.0, 23, 'Male', 134778.0],
       ['AsstProf', 'B', 1.0, 0, 'Male', 88000.0],
       ['Prof', 'B', nan, 33, 'Male', 162200.0],
       ['Prof', 'B', 25.0, 19, 'Male', 153750.0],
       ['Prof', 'B', 17.0, 3, 'Male', 150480.0],
       ['AsstProf', 'B', 8.0, 3, 'Male', 75044.0],
       ['AsstProf', 'B', 4.0, 0, 'Male', 92000.0],
       ['Prof', 'A', 19.0, 7, 'Male', 107300.0],
       ['Prof', 'A', 29.0, 27, 'Male', 150500.0],
       ['AsstProf', 'B', 4.0, 4, 'Male', 92000.0],
       ['Prof', 'A', 33.0, 30, 'Male', 103106.0],
       ['AsstProf', 'A', 4.0, 2, 'Male', 73000.0],
       ['AsstProf', 'A', 2.0, 0, 'Male', 85000.0],
       ['Prof', 'A', 30.0, 23, 'Male', 91100.0],
       ['Prof', 'B', 35.0, 31, 'Male', 99418.0],
       ['Prof', 'A', 38.0, 19, 'Male', 148750.0],
       ['Prof', 'A', 45.0, 43, 'Male', 155865.0],
       ['AsstProf', 'B', 7.0, 2, 'Male', nan],
       ['Prof', 'B', 21.0, 20, 'Male', 123683.0],
       ['AssocProf', 'B', 9.0, 7, 'Male', 107008.0],
       ['Prof', 'B', 22.0, 21, 'Male', 155750.0],
       ['Prof', 'A', 27.0, 19, 'Male', 103275.0],
       ['Prof', 'B', 18.0, 18, 'Male', 120000.0],
       ['AssocProf', 'B', nan, 8, 'Male', 119800.0],
       ['Prof', 'B', 28.0, 23, 'Male', 126933.0],
       ['Prof', 'B', 45.0, 45, 'Male', 146856.0],
       ['Prof', 'A', 20.0, 8, 'Male', 102000.0],
       ['AsstProf', 'B', 4.0, 3, 'Male', 91000.0],
       ['Prof', 'B', 18.0, 18, 'Female', 129000.0],
       ['Prof', 'A', 39.0, 36, 'Female', 137000.0],
       ['AssocProf', 'A', 13.0, 8, 'Female', 74830.0],
       ['AsstProf', 'B', 4.0, 2, 'Female', 80225.0],
       ['AsstProf', 'B', 5.0, 0, 'Female', 77000.0],
       ['Prof', 'B', 23.0, 19, 'Female', 151768.0],
       ['Prof', 'B', 25.0, 25, 'Female', 140096.0],
       ['AsstProf', 'B', 11.0, 3, 'Female', 74692.0],
       ['AssocProf', 'B', 11.0, 11, 'Female', 103613.0],
       ['Prof', 'B', 17.0, 17, 'Female', 111512.0],
       ['Prof', 'B', 17.0, 18, 'Female', 122960.0],
       ['AsstProf', 'B', 10.0, 5, 'Female', 97032.0],
       ['Prof', 'B', 20.0, 14, 'Female', 127512.0],
       ['Prof', 'A', 12.0, 0, 'Female', 105000.0],
       ['AsstProf', 'A', 5.0, 3, 'Female', 73500.0],
       ['AssocProf', 'A', 25.0, 22, 'Female', 62884.0],
       ['AsstProf', 'A', 2.0, 0, 'Female', 72500.0],
       ['AssocProf', 'A', 10.0, 8, 'Female', 77500.0],
       ['AsstProf', 'A', 3.0, 1, 'Female', 72500.0],
       ['Prof', 'B', 36.0, 26, 'Female', 144651.0],
       ['AssocProf', 'B', 12.0, 10, 'Female', 103994.0],
       ['AsstProf', 'B', 3.0, 3, 'Female', 92000.0],
       ['AssocProf', 'B', 13.0, 10, 'Female', 103750.0],
       ['AssocProf', 'B', 14.0, 7, 'Female', 109650.0],
       ['Prof', 'A', 29.0, 27, 'Female', 91000.0],
       ['AssocProf', 'A', 26.0, 24, 'Female', 73300.0],
       ['Prof', 'A', 36.0, 19, 'Female', 117555.0],
       ['AsstProf', 'A', 7.0, 6, 'Female', 63100.0],
       ['Prof', 'A', 17.0, 11, 'Female', 90450.0],
       ['AsstProf', 'A', 4.0, 2, 'Female', 77500.0],
       ['Prof', 'A', 28.0, 7, 'Female', 116450.0],
       ['AsstProf', 'A', 8.0, 3, 'Female', 78500.0],
       ['AssocProf', 'B', 12.0, 9, 'Female', 71065.0],
       ['Prof', 'B', 24.0, 15, 'Female', 161101.0],
       ['Prof', 'B', 18.0, 10, 'Female', 105450.0],
       ['AssocProf', 'B', 19.0, 6, 'Female', 104542.0],
       ['Prof', 'B', 17.0, 17, 'Female', 124312.0],
       ['Prof', 'A', 28.0, 14, 'Female', 109954.0],
       ['Prof', 'A', 23.0, 15, 'Female', 109646.0]], dtype=object)

In [81]:
df.describe()                                       # gives only numeric data

             phd    service         salary
count  76.000000  78.000000      76.000000
mean   19.605263  15.051282  108003.355263
std    12.508215  12.139768   28525.350088
min     1.000000   0.000000   57800.000000
25%    10.000000   5.250000   87250.000000
50%    18.500000  14.500000  104671.000000
75%    27.250000  20.750000  127077.750000
max    56.000000  51.000000  186960.000000

In [92]:
df.describe(include=['object', 'float64', 'int64', 'bool'])  # will give non numeric data also

        rank discipline        phd    service     sex         salary
count     78         78  76.000000  78.000000      78      76.000000
unique     3          2        NaN        NaN       2            NaN
top     Prof          B        NaN        NaN  Female            NaN
freq      46         42        NaN        NaN      39            NaN
mean     NaN        NaN  19.605263  15.051282     NaN  108003.355263
std      NaN        NaN  12.508215  12.139768     NaN   28525.350088
min      NaN        NaN   1.000000   0.000000     NaN   57800.000000
25%      NaN        NaN  10.000000   5.250000     NaN   87250.000000
50%      NaN        NaN  18.500000  14.500000     NaN  104671.000000
75%      NaN        NaN  27.250000  20.750000     NaN  127077.750000
max      NaN        NaN  56.000000  51.000000     NaN  186960.000000

In [84]:
df.max()                                         # max of all features

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [87]:
df.min()                                         # min of all features

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [88]:
df.mean()

phd            19.605263
service        15.051282
salary     108003.355263
dtype: float64

In [90]:
df.mode()

   rank discipline  phd  service     sex   salary
0  Prof          B  4.0      3.0  Female  92000.0
1   NaN        NaN  NaN      NaN    Male      NaN

In [91]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [94]:
df.std()                                               # gives std of numeric data

phd           12.508215
service       12.139768
salary     28525.350088
dtype: float64

In [96]:
df.head(50).mean()                                    # mean of first 50 records

phd            21.437500
service        17.600000
salary     113997.020833
dtype: float64

In [99]:
df.sample(10)                                        # gives random records  for given number

         rank discipline   phd  service     sex    salary
74  AssocProf          B  19.0        6  Female  104542.0
38   AsstProf          B   4.0        3    Male   91000.0
63       Prof          A  29.0       27  Female   91000.0
35       Prof          B  28.0       23    Male  126933.0
9        Prof          A  51.0       51    Male   57800.0
4        Prof          B  20.0       18    Male  104800.0
22   AsstProf          A   4.0        2    Male   73000.0
42   AsstProf          B   4.0        2  Female   80225.0
72       Prof          B  24.0       15  Female  161101.0
45       Prof          B  25.0       25  Female  140096.0

In [105]:
df.loc[10:50]                                       # gives only desired rows

         rank discipline   phd  service     sex    salary
10       Prof          B  39.0       33    Male  128250.0
11       Prof          B  23.0       23    Male  134778.0
12   AsstProf          B   1.0        0    Male   88000.0
13       Prof          B   NaN       33    Male  162200.0
14       Prof          B  25.0       19    Male  153750.0
15       Prof          B  17.0        3    Male  150480.0
16   AsstProf          B   8.0        3    Male   75044.0
17   AsstProf          B   4.0        0    Male   92000.0
18       Prof          A  19.0        7    Male  107300.0
19       Prof          A  29.0       27    Male  150500.0
20   AsstProf          B   4.0        4    Male   92000.0
21       Prof          A  33.0       30    Male  103106.0
22   AsstProf          A   4.0        2    Male   73000.0
23   AsstProf          A   2.0        0    Male   85000.0
24       Prof          A  30.0       23    Male   91100.0
25       Prof          B  35.0       31    Male   99418.0
26       Prof          A  38.0       19    Male  148750.0
27       Prof          A  45.0       43    Male  155865.0
28   AsstProf          B   7.0        2    Male       NaN
29       Prof          B  21.0       20    Male  123683.0
30  AssocProf          B   9.0        7    Male  107008.0
31       Prof          B  22.0       21    Male  155750.0
32       Prof          A  27.0       19    Male  103275.0
33       Prof          B  18.0       18    Male  120000.0
34  AssocProf          B   NaN        8    Male  119800.0
35       Prof          B  28.0       23    Male  126933.0
36       Prof          B  45.0       45    Male  146856.0
37       Prof          A  20.0        8    Male  102000.0
38   AsstProf          B   4.0        3    Male   91000.0
39       Prof          B  18.0       18  Female  129000.0
40       Prof          A  39.0       36  Female  137000.0
41  AssocProf          A  13.0        8  Female   74830.0
42   AsstProf          B   4.0        2  Female   80225.0
43   AsstProf          B   5.0        0  Female   77000.0
44       Prof          B  23.0       19  Female  151768.0
45       Prof          B  25.0       25  Female  140096.0
46   AsstProf          B  11.0        3  Female   74692.0
47  AssocProf          B  11.0       11  Female  103613.0
48       Prof          B  17.0       17  Female  111512.0
49       Prof          B  17.0       18  Female  122960.0
50   AsstProf          B  10.0        5  Female   97032.0

In [109]:
df.loc[10:30,['rank','salary']]                           # specific rows with specific columns

         rank    salary
10       Prof  128250.0
11       Prof  134778.0
12   AsstProf   88000.0
13       Prof  162200.0
14       Prof  153750.0
15       Prof  150480.0
16   AsstProf   75044.0
17   AsstProf   92000.0
18       Prof  107300.0
19       Prof  150500.0
20   AsstProf   92000.0
21       Prof  103106.0
22   AsstProf   73000.0
23   AsstProf   85000.0
24       Prof   91100.0
25       Prof   99418.0
26       Prof  148750.0
27       Prof  155865.0
28   AsstProf       NaN
29       Prof  123683.0
30  AssocProf  107008.0

In [117]:
df.iloc[10:20, 2:5]                                   # 10 -19 rows and 2-5 columns

     phd  service   sex
10  39.0       33  Male
11  23.0       23  Male
12   1.0        0  Male
13   NaN       33  Male
14  25.0       19  Male
15  17.0        3  Male
16   8.0        3  Male
17   4.0        0  Male
18  19.0        7  Male
19  29.0       27  Male

In [118]:
df.iloc[[2,4,6,9], [2,3,4,1]]

    phd  service   sex discipline
2  23.0       20  Male          A
4  20.0       18  Male          B
6  20.0       17  Male          A
9  51.0       51  Male          A

In [129]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [130]:
list1 = df['rank'].unique().tolist()
print(list1)

['Prof', 'AssocProf', 'AsstProf']

In [234]:
df[['rank','salary']][df['sex']=='Female']                    # gives rank where sex is female

         rank    salary
39       Prof  129000.0
40       Prof  137000.0
41  AssocProf   74830.0
42   AsstProf   80225.0
43   AsstProf   77000.0
44       Prof  151768.0
45       Prof  140096.0
46   AsstProf   74692.0
47  AssocProf  103613.0
48       Prof  111512.0
49       Prof  122960.0
50   AsstProf   97032.0
51       Prof  127512.0
52       Prof  105000.0
53   AsstProf   73500.0
54  AssocProf   62884.0
55   AsstProf   72500.0
56  AssocProf   77500.0
57   AsstProf   72500.0
58       Prof  144651.0
59  AssocProf  103994.0
60   AsstProf   92000.0
61  AssocProf  103750.0
62  AssocProf  109650.0
63       Prof   91000.0
64  AssocProf   73300.0
65       Prof  117555.0
66   AsstProf   63100.0
67       Prof   90450.0
68   AsstProf   77500.0
69       Prof  116450.0
70   AsstProf   78500.0
71  AssocProf   71065.0
72       Prof  161101.0
73       Prof  105450.0
74  AssocProf  104542.0
75       Prof  124312.0
76       Prof  109954.0
77       Prof  109646.0

In [224]:
(df['rank'][df['sex']=='Female']).value_counts()            # gives no. of female as per rank

Prof         18
AsstProf     11
AssocProf    10
Name: rank, dtype: int64

In [254]:
df[(df['sex']=='Female') & (df['rank']=='Prof')]              # gives true and false

    rank discipline   phd  service     sex    salary
39  Prof          B  18.0       18  Female  129000.0
40  Prof          A  39.0       36  Female  137000.0
44  Prof          B  23.0       19  Female  151768.0
45  Prof          B  25.0       25  Female  140096.0
48  Prof          B  17.0       17  Female  111512.0
49  Prof          B  17.0       18  Female  122960.0
51  Prof          B  20.0       14  Female  127512.0
52  Prof          A  12.0        0  Female  105000.0
58  Prof          B  36.0       26  Female  144651.0
63  Prof          A  29.0       27  Female   91000.0
65  Prof          A  36.0       19  Female  117555.0
67  Prof          A  17.0       11  Female   90450.0
69  Prof          A  28.0        7  Female  116450.0
72  Prof          B  24.0       15  Female  161101.0
73  Prof          B  18.0       10  Female  105450.0
75  Prof          B  17.0       17  Female  124312.0
76  Prof          A  28.0       14  Female  109954.0
77  Prof          A  23.0       15  Female  109646.0

In [258]:
df[(df['sex']=='Female') & (df['rank']=='Prof')]           # gives only female prof

    rank discipline   phd  service     sex    salary
39  Prof          B  18.0       18  Female  129000.0
40  Prof          A  39.0       36  Female  137000.0
44  Prof          B  23.0       19  Female  151768.0
45  Prof          B  25.0       25  Female  140096.0
48  Prof          B  17.0       17  Female  111512.0
49  Prof          B  17.0       18  Female  122960.0
51  Prof          B  20.0       14  Female  127512.0
52  Prof          A  12.0        0  Female  105000.0
58  Prof          B  36.0       26  Female  144651.0
63  Prof          A  29.0       27  Female   91000.0
65  Prof          A  36.0       19  Female  117555.0
67  Prof          A  17.0       11  Female   90450.0
69  Prof          A  28.0        7  Female  116450.0
72  Prof          B  24.0       15  Female  161101.0
73  Prof          B  18.0       10  Female  105450.0
75  Prof          B  17.0       17  Female  124312.0
76  Prof          A  28.0       14  Female  109954.0
77  Prof          A  23.0       15  Female  109646.0

In [201]:
c = (df['sex'][df['rank']=='Prof']).value_counts(normalize=True)*100      # gives % of male and female when rank is Prof              
print(c)

Male      60.869565
Female    39.130435
Name: sex, dtype: float64

In [214]:
(df['salary']).value_counts(dropna=False)                                 # gives salary count including NaN

92000.0     3
72500.0     2
NaN         2
77500.0     2
91000.0     2
           ..
103994.0    1
107300.0    1
120000.0    1
140096.0    1
104800.0    1
Name: salary, Length: 72, dtype: int64

In [215]:
(df['salary']).value_counts(dropna=True)                              # without NaN

92000.0     3
77500.0     2
72500.0     2
91000.0     2
117555.0    1
           ..
103994.0    1
107300.0    1
140096.0    1
88000.0     1
104800.0    1
Name: salary, Length: 71, dtype: int64

In [239]:
((df['rank']).value_counts())                                       # rank wise destribution

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [240]:
df['salary'].describe()                                            # description of perticolar column salary

count        76.000000
mean     108003.355263
std       28525.350088
min       57800.000000
25%       87250.000000
50%      104671.000000
75%      127077.750000
max      186960.000000
Name: salary, dtype: float64

In [244]:
df['salary'].isnull()                                           # gives true and false

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75    False
76    False
77    False
Name: salary, Length: 78, dtype: bool

In [259]:
df[df['salary'].isnull()]                                     # it gives data frame

        rank discipline   phd  service   sex  salary
7       Prof          A  18.0       18  Male     NaN
28  AsstProf          B   7.0        2  Male     NaN

In [341]:
grp1 = df.groupby(['sex','rank'])
for i in grp1:
    print(i)
    print('\n \n ')

(('Female', 'AssocProf'),          rank discipline   phd  service     sex    salary
41  AssocProf          A  13.0        8  Female   74830.0
47  AssocProf          B  11.0       11  Female  103613.0
54  AssocProf          A  25.0       22  Female   62884.0
56  AssocProf          A  10.0        8  Female   77500.0
59  AssocProf          B  12.0       10  Female  103994.0
61  AssocProf          B  13.0       10  Female  103750.0
62  AssocProf          B  14.0        7  Female  109650.0
64  AssocProf          A  26.0       24  Female   73300.0
71  AssocProf          B  12.0        9  Female   71065.0
74  AssocProf          B  19.0        6  Female  104542.0)



(('Female', 'AsstProf'),         rank discipline   phd  service     sex   salary
42  AsstProf          B   4.0        2  Female  80225.0
43  AsstProf          B   5.0        0  Female  77000.0
46  AsstProf          B  11.0        3  Female  74692.0
50  AsstProf          B  10.0        5  Female  97032.0
53  AsstProf          A   5.0        3  Female  73500.0
55  AsstProf          A   2.0        0  Female  72500.0
57  AsstProf          A   3.0        1  Female  72500.0
60  AsstProf          B   3.0        3  Female  92000.0
66  AsstProf          A   7.0        6  Female  63100.0
68  AsstProf          A   4.0        2  Female  77500.0
70  AsstProf          A   8.0        3  Female  78500.0)



(('Female', 'Prof'),     rank discipline   phd  service     sex    salary
39  Prof          B  18.0       18  Female  129000.0
40  Prof          A  39.0       36  Female  137000.0
44  Prof          B  23.0       19  Female  151768.0
45  Prof          B  25.0       25  Female  140096.0
48  Prof          B  17.0       17  Female  111512.0
49  Prof          B  17.0       18  Female  122960.0
51  Prof          B  20.0       14  Female  127512.0
52  Prof          A  12.0        0  Female  105000.0
58  Prof          B  36.0       26  Female  144651.0
63  Prof          A  29.0       27  Female   91000.0
65  Prof          A  36.0       19  Female  117555.0
67  Prof          A  17.0       11  Female   90450.0
69  Prof          A  28.0        7  Female  116450.0
72  Prof          B  24.0       15  Female  161101.0
73  Prof          B  18.0       10  Female  105450.0
75  Prof          B  17.0       17  Female  124312.0
76  Prof          A  28.0       14  Female  109954.0
77  Prof          A  23.0       15  Female  109646.0)



(('Male', 'AssocProf'),          rank discipline   phd  service   sex    salary
6   AssocProf          A  20.0       17  Male   81285.0
30  AssocProf          B   9.0        7  Male  107008.0
34  AssocProf          B   NaN        8  Male  119800.0)



(('Male', 'AsstProf'),         rank discipline  phd  service   sex   salary
12  AsstProf          B  1.0        0  Male  88000.0
16  AsstProf          B  8.0        3  Male  75044.0
17  AsstProf          B  4.0        0  Male  92000.0
20  AsstProf          B  4.0        4  Male  92000.0
22  AsstProf          A  4.0        2  Male  73000.0
23  AsstProf          A  2.0        0  Male  85000.0
28  AsstProf          B  7.0        2  Male      NaN
38  AsstProf          B  4.0        3  Male  91000.0)



(('Male', 'Prof'),     rank discipline   phd  service   sex    salary
0   Prof          B  56.0       49  Male  186960.0
1   Prof          A  12.0        6  Male   93000.0
2   Prof          A  23.0       20  Male  110515.0
3   Prof          A  40.0       31  Male  131205.0
4   Prof          B  20.0       18  Male  104800.0
5   Prof          A  20.0       20  Male  122400.0
7   Prof          A  18.0       18  Male       NaN
8   Prof          A  29.0       19  Male   94350.0
9   Prof          A  51.0       51  Male   57800.0
10  Prof          B  39.0       33  Male  128250.0
11  Prof          B  23.0       23  Male  134778.0
13  Prof          B   NaN       33  Male  162200.0
14  Prof          B  25.0       19  Male  153750.0
15  Prof          B  17.0        3  Male  150480.0
18  Prof          A  19.0        7  Male  107300.0
19  Prof          A  29.0       27  Male  150500.0
21  Prof          A  33.0       30  Male  103106.0
24  Prof          A  30.0       23  Male   91100.0
25  Prof          B  35.0       31  Male   99418.0
26  Prof          A  38.0       19  Male  148750.0
27  Prof          A  45.0       43  Male  155865.0
29  Prof          B  21.0       20  Male  123683.0
31  Prof          B  22.0       21  Male  155750.0
32  Prof          A  27.0       19  Male  103275.0
33  Prof          B  18.0       18  Male  120000.0
35  Prof          B  28.0       23  Male  126933.0
36  Prof          B  45.0       45  Male  146856.0
37  Prof          A  20.0        8  Male  102000.0)

In [356]:
df.groupby(['sex','rank']).mean()

                        phd    service         salary
sex    rank
Female AssocProf  15.500000  11.500000   88512.800000
       AsstProf    5.636364   2.545455   78049.909091
       Prof       23.722222  17.111111  121967.611111
Male   AssocProf  14.500000  10.666667  102697.666667
       AsstProf    4.250000   1.750000   85149.142857
       Prof       29.000000  24.178571  124630.518519

In [362]:
df.groupby(['sex','rank']).min()

                 discipline   phd  service   salary
sex    rank
Female AssocProf          A  10.0        6  62884.0
       AsstProf           A   2.0        0  63100.0
       Prof               A  12.0        0  90450.0
Male   AssocProf          A   9.0        7  81285.0
       AsstProf           A   1.0        0  73000.0
       Prof               A  12.0        3  57800.0

In [363]:
df.groupby(['sex','rank']).max()

                 discipline   phd  service    salary
sex    rank
Female AssocProf          B  26.0       24  109650.0
       AsstProf           B  11.0        6   97032.0
       Prof               B  39.0       36  161101.0
Male   AssocProf          B  20.0       17  119800.0
       AsstProf           B   8.0        4   92000.0
       Prof               B  56.0       51  186960.0

In [350]:
c= df.groupby('rank')
for i in c:
    print(i)

('AssocProf',          rank discipline   phd  service     sex    salary
6   AssocProf          A  20.0       17    Male   81285.0
30  AssocProf          B   9.0        7    Male  107008.0
34  AssocProf          B   NaN        8    Male  119800.0
41  AssocProf          A  13.0        8  Female   74830.0
47  AssocProf          B  11.0       11  Female  103613.0
54  AssocProf          A  25.0       22  Female   62884.0
56  AssocProf          A  10.0        8  Female   77500.0
59  AssocProf          B  12.0       10  Female  103994.0
61  AssocProf          B  13.0       10  Female  103750.0
62  AssocProf          B  14.0        7  Female  109650.0
64  AssocProf          A  26.0       24  Female   73300.0
71  AssocProf          B  12.0        9  Female   71065.0
74  AssocProf          B  19.0        6  Female  104542.0)
('AsstProf',         rank discipline   phd  service     sex   salary
12  AsstProf          B   1.0        0    Male  88000.0
16  AsstProf          B   8.0        3    Male  75044.0
17  AsstProf          B   4.0        0    Male  92000.0
20  AsstProf          B   4.0        4    Male  92000.0
22  AsstProf          A   4.0        2    Male  73000.0
23  AsstProf          A   2.0        0    Male  85000.0
28  AsstProf          B   7.0        2    Male      NaN
38  AsstProf          B   4.0        3    Male  91000.0
42  AsstProf          B   4.0        2  Female  80225.0
43  AsstProf          B   5.0        0  Female  77000.0
46  AsstProf          B  11.0        3  Female  74692.0
50  AsstProf          B  10.0        5  Female  97032.0
53  AsstProf          A   5.0        3  Female  73500.0
55  AsstProf          A   2.0        0  Female  72500.0
57  AsstProf          A   3.0        1  Female  72500.0
60  AsstProf          B   3.0        3  Female  92000.0
66  AsstProf          A   7.0        6  Female  63100.0
68  AsstProf          A   4.0        2  Female  77500.0
70  AsstProf          A   8.0        3  Female  78500.0)
('Prof',     rank discipline   phd  service     sex    salary
0   Prof          B  56.0       49    Male  186960.0
1   Prof          A  12.0        6    Male   93000.0
2   Prof          A  23.0       20    Male  110515.0
3   Prof          A  40.0       31    Male  131205.0
4   Prof          B  20.0       18    Male  104800.0
5   Prof          A  20.0       20    Male  122400.0
7   Prof          A  18.0       18    Male       NaN
8   Prof          A  29.0       19    Male   94350.0
9   Prof          A  51.0       51    Male   57800.0
10  Prof          B  39.0       33    Male  128250.0
11  Prof          B  23.0       23    Male  134778.0
13  Prof          B   NaN       33    Male  162200.0
14  Prof          B  25.0       19    Male  153750.0
15  Prof          B  17.0        3    Male  150480.0
18  Prof          A  19.0        7    Male  107300.0
19  Prof          A  29.0       27    Male  150500.0
21  Prof          A  33.0       30    Male  103106.0
24  Prof          A  30.0       23    Male   91100.0
25  Prof          B  35.0       31    Male   99418.0
26  Prof          A  38.0       19    Male  148750.0
27  Prof          A  45.0       43    Male  155865.0
29  Prof          B  21.0       20    Male  123683.0
31  Prof          B  22.0       21    Male  155750.0
32  Prof          A  27.0       19    Male  103275.0
33  Prof          B  18.0       18    Male  120000.0
35  Prof          B  28.0       23    Male  126933.0
36  Prof          B  45.0       45    Male  146856.0
37  Prof          A  20.0        8    Male  102000.0
39  Prof          B  18.0       18  Female  129000.0
40  Prof          A  39.0       36  Female  137000.0
44  Prof          B  23.0       19  Female  151768.0
45  Prof          B  25.0       25  Female  140096.0
48  Prof          B  17.0       17  Female  111512.0
49  Prof          B  17.0       18  Female  122960.0
51  Prof          B  20.0       14  Female  127512.0
52  Prof          A  12.0        0  Female  105000.0
58  Prof          B  36.0       26  Female  144651.0
63  Prof          A  29.0       27  Female   91000.0
65  Prof          A  36.0       19  Female  117555.0
67  Prof          A  17.0       11  Female   90450.0
69  Prof          A  28.0        7  Female  116450.0
72  Prof          B  24.0       15  Female  161101.0
73  Prof          B  18.0       10  Female  105450.0
75  Prof          B  17.0       17  Female  124312.0
76  Prof          A  28.0       14  Female  109954.0
77  Prof          A  23.0       15  Female  109646.0)

In [360]:
grp2 = df.groupby(['rank','sex','discipline'])
for i in grp2:
    print(i)

(('AssocProf', 'Female', 'A'),          rank discipline   phd  service     sex   salary
41  AssocProf          A  13.0        8  Female  74830.0
54  AssocProf          A  25.0       22  Female  62884.0
56  AssocProf          A  10.0        8  Female  77500.0
64  AssocProf          A  26.0       24  Female  73300.0)
(('AssocProf', 'Female', 'B'),          rank discipline   phd  service     sex    salary
47  AssocProf          B  11.0       11  Female  103613.0
59  AssocProf          B  12.0       10  Female  103994.0
61  AssocProf          B  13.0       10  Female  103750.0
62  AssocProf          B  14.0        7  Female  109650.0
71  AssocProf          B  12.0        9  Female   71065.0
74  AssocProf          B  19.0        6  Female  104542.0)
(('AssocProf', 'Male', 'A'),         rank discipline   phd  service   sex   salary
6  AssocProf          A  20.0       17  Male  81285.0)
(('AssocProf', 'Male', 'B'),          rank discipline  phd  service   sex    salary
30  AssocProf          B  9.0        7  Male  107008.0
34  AssocProf          B  NaN        8  Male  119800.0)
(('AsstProf', 'Female', 'A'),         rank discipline  phd  service     sex   salary
53  AsstProf          A  5.0        3  Female  73500.0
55  AsstProf          A  2.0        0  Female  72500.0
57  AsstProf          A  3.0        1  Female  72500.0
66  AsstProf          A  7.0        6  Female  63100.0
68  AsstProf          A  4.0        2  Female  77500.0
70  AsstProf          A  8.0        3  Female  78500.0)
(('AsstProf', 'Female', 'B'),         rank discipline   phd  service     sex   salary
42  AsstProf          B   4.0        2  Female  80225.0
43  AsstProf          B   5.0        0  Female  77000.0
46  AsstProf          B  11.0        3  Female  74692.0
50  AsstProf          B  10.0        5  Female  97032.0
60  AsstProf          B   3.0        3  Female  92000.0)
(('AsstProf', 'Male', 'A'),         rank discipline  phd  service   sex   salary
22  AsstProf          A  4.0        2  Male  73000.0
23  AsstProf          A  2.0        0  Male  85000.0)
(('AsstProf', 'Male', 'B'),         rank discipline  phd  service   sex   salary
12  AsstProf          B  1.0        0  Male  88000.0
16  AsstProf          B  8.0        3  Male  75044.0
17  AsstProf          B  4.0        0  Male  92000.0
20  AsstProf          B  4.0        4  Male  92000.0
28  AsstProf          B  7.0        2  Male      NaN
38  AsstProf          B  4.0        3  Male  91000.0)
(('Prof', 'Female', 'A'),     rank discipline   phd  service     sex    salary
40  Prof          A  39.0       36  Female  137000.0
52  Prof          A  12.0        0  Female  105000.0
63  Prof          A  29.0       27  Female   91000.0
65  Prof          A  36.0       19  Female  117555.0
67  Prof          A  17.0       11  Female   90450.0
69  Prof          A  28.0        7  Female  116450.0
76  Prof          A  28.0       14  Female  109954.0
77  Prof          A  23.0       15  Female  109646.0)
(('Prof', 'Female', 'B'),     rank discipline   phd  service     sex    salary
39  Prof          B  18.0       18  Female  129000.0
44  Prof          B  23.0       19  Female  151768.0
45  Prof          B  25.0       25  Female  140096.0
48  Prof          B  17.0       17  Female  111512.0
49  Prof          B  17.0       18  Female  122960.0
51  Prof          B  20.0       14  Female  127512.0
58  Prof          B  36.0       26  Female  144651.0
72  Prof          B  24.0       15  Female  161101.0
73  Prof          B  18.0       10  Female  105450.0
75  Prof          B  17.0       17  Female  124312.0)
(('Prof', 'Male', 'A'),     rank discipline   phd  service   sex    salary
1   Prof          A  12.0        6  Male   93000.0
2   Prof          A  23.0       20  Male  110515.0
3   Prof          A  40.0       31  Male  131205.0
5   Prof          A  20.0       20  Male  122400.0
7   Prof          A  18.0       18  Male       NaN
8   Prof          A  29.0       19  Male   94350.0
9   Prof          A  51.0       51  Male   57800.0
18  Prof          A  19.0        7  Male  107300.0
19  Prof          A  29.0       27  Male  150500.0
21  Prof          A  33.0       30  Male  103106.0
24  Prof          A  30.0       23  Male   91100.0
26  Prof          A  38.0       19  Male  148750.0
27  Prof          A  45.0       43  Male  155865.0
32  Prof          A  27.0       19  Male  103275.0
37  Prof          A  20.0        8  Male  102000.0)
(('Prof', 'Male', 'B'),     rank discipline   phd  service   sex    salary
0   Prof          B  56.0       49  Male  186960.0
4   Prof          B  20.0       18  Male  104800.0
10  Prof          B  39.0       33  Male  128250.0
11  Prof          B  23.0       23  Male  134778.0
13  Prof          B   NaN       33  Male  162200.0
14  Prof          B  25.0       19  Male  153750.0
15  Prof          B  17.0        3  Male  150480.0
25  Prof          B  35.0       31  Male   99418.0
29  Prof          B  21.0       20  Male  123683.0
31  Prof          B  22.0       21  Male  155750.0
33  Prof          B  18.0       18  Male  120000.0
35  Prof          B  28.0       23  Male  126933.0
36  Prof          B  45.0       45  Male  146856.0)

In [361]:
 df.groupby(['rank','sex','discipline']).median()

                              phd  service    salary
rank      sex    discipline
AssocProf Female A           19.0     15.0   74065.0
                 B           12.5      9.5  103872.0
          Male   A           20.0     17.0   81285.0
                 B            9.0      7.5  113404.0
AsstProf  Female A            4.5      2.5   73000.0
                 B            5.0      3.0   80225.0
          Male   A            3.0      1.0   79000.0
                 B            4.0      2.5   91000.0
Prof      Female A           28.0     14.5  109800.0
                 B           19.0     17.5  128256.0
          Male   A           29.0     20.0  105287.5
                 B           24.0     23.0  134778.0

In [381]:
df[df['salary']>=100000]

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
5        Prof          A  20.0       20    Male  122400.0
10       Prof          B  39.0       33    Male  128250.0
11       Prof          B  23.0       23    Male  134778.0
13       Prof          B   NaN       33    Male  162200.0
14       Prof          B  25.0       19    Male  153750.0
15       Prof          B  17.0        3    Male  150480.0
18       Prof          A  19.0        7    Male  107300.0
19       Prof          A  29.0       27    Male  150500.0
21       Prof          A  33.0       30    Male  103106.0
26       Prof          A  38.0       19    Male  148750.0
27       Prof          A  45.0       43    Male  155865.0
29       Prof          B  21.0       20    Male  123683.0
30  AssocProf          B   9.0        7    Male  107008.0
31       Prof          B  22.0       21    Male  155750.0
32       Prof          A  27.0       19    Male  103275.0
33       Prof          B  18.0       18    Male  120000.0
34  AssocProf          B   NaN        8    Male  119800.0
35       Prof          B  28.0       23    Male  126933.0
36       Prof          B  45.0       45    Male  146856.0
37       Prof          A  20.0        8    Male  102000.0
39       Prof          B  18.0       18  Female  129000.0
40       Prof          A  39.0       36  Female  137000.0
44       Prof          B  23.0       19  Female  151768.0
45       Prof          B  25.0       25  Female  140096.0
47  AssocProf          B  11.0       11  Female  103613.0
48       Prof          B  17.0       17  Female  111512.0
49       Prof          B  17.0       18  Female  122960.0
51       Prof          B  20.0       14  Female  127512.0
52       Prof          A  12.0        0  Female  105000.0
58       Prof          B  36.0       26  Female  144651.0
59  AssocProf          B  12.0       10  Female  103994.0
61  AssocProf          B  13.0       10  Female  103750.0
62  AssocProf          B  14.0        7  Female  109650.0
65       Prof          A  36.0       19  Female  117555.0
69       Prof          A  28.0        7  Female  116450.0
72       Prof          B  24.0       15  Female  161101.0
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [380]:
df1= df[df['salary']>=100000]
df1['rank'].unique()

array(['Prof', 'AssocProf'], dtype=object)

In [387]:
df[['salary','sex']][df['sex'] == 'Female' ]

      salary     sex
39  129000.0  Female
40  137000.0  Female
41   74830.0  Female
42   80225.0  Female
43   77000.0  Female
44  151768.0  Female
45  140096.0  Female
46   74692.0  Female
47  103613.0  Female
48  111512.0  Female
49  122960.0  Female
50   97032.0  Female
51  127512.0  Female
52  105000.0  Female
53   73500.0  Female
54   62884.0  Female
55   72500.0  Female
56   77500.0  Female
57   72500.0  Female
58  144651.0  Female
59  103994.0  Female
60   92000.0  Female
61  103750.0  Female
62  109650.0  Female
63   91000.0  Female
64   73300.0  Female
65  117555.0  Female
66   63100.0  Female
67   90450.0  Female
68   77500.0  Female
69  116450.0  Female
70   78500.0  Female
71   71065.0  Female
72  161101.0  Female
73  105450.0  Female
74  104542.0  Female
75  124312.0  Female
76  109954.0  Female
77  109646.0  Female

In [385]:
df[df['sex'] == 'Female' ][['salary','sex']]

      salary     sex
39  129000.0  Female
40  137000.0  Female
41   74830.0  Female
42   80225.0  Female
43   77000.0  Female
44  151768.0  Female
45  140096.0  Female
46   74692.0  Female
47  103613.0  Female
48  111512.0  Female
49  122960.0  Female
50   97032.0  Female
51  127512.0  Female
52  105000.0  Female
53   73500.0  Female
54   62884.0  Female
55   72500.0  Female
56   77500.0  Female
57   72500.0  Female
58  144651.0  Female
59  103994.0  Female
60   92000.0  Female
61  103750.0  Female
62  109650.0  Female
63   91000.0  Female
64   73300.0  Female
65  117555.0  Female
66   63100.0  Female
67   90450.0  Female
68   77500.0  Female
69  116450.0  Female
70   78500.0  Female
71   71065.0  Female
72  161101.0  Female
73  105450.0  Female
74  104542.0  Female
75  124312.0  Female
76  109954.0  Female
77  109646.0  Female

## Sorting of columns

In [391]:
df.sort_values(by='salary')

         rank discipline   phd  service     sex    salary
9        Prof          A  51.0       51    Male   57800.0
54  AssocProf          A  25.0       22  Female   62884.0
66   AsstProf          A   7.0        6  Female   63100.0
71  AssocProf          B  12.0        9  Female   71065.0
57   AsstProf          A   3.0        1  Female   72500.0
..        ...        ...   ...      ...     ...       ...
72       Prof          B  24.0       15  Female  161101.0
13       Prof          B   NaN       33    Male  162200.0
0        Prof          B  56.0       49    Male  186960.0
7        Prof          A  18.0       18    Male       NaN
28   AsstProf          B   7.0        2    Male       NaN

[78 rows x 6 columns]

In [401]:
df.sort_values(by=['salary'],ascending=True)

         rank discipline   phd  service     sex    salary
9        Prof          A  51.0       51    Male   57800.0
54  AssocProf          A  25.0       22  Female   62884.0
66   AsstProf          A   7.0        6  Female   63100.0
71  AssocProf          B  12.0        9  Female   71065.0
57   AsstProf          A   3.0        1  Female   72500.0
..        ...        ...   ...      ...     ...       ...
72       Prof          B  24.0       15  Female  161101.0
13       Prof          B   NaN       33    Male  162200.0
0        Prof          B  56.0       49    Male  186960.0
7        Prof          A  18.0       18    Male       NaN
28   AsstProf          B   7.0        2    Male       NaN

[78 rows x 6 columns]

In [403]:
df.sort_values(by=['salary','phd'],ascending=[False,True])

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
13       Prof          B   NaN       33    Male  162200.0
72       Prof          B  24.0       15  Female  161101.0
27       Prof          A  45.0       43    Male  155865.0
31       Prof          B  22.0       21    Male  155750.0
..        ...        ...   ...      ...     ...       ...
66   AsstProf          A   7.0        6  Female   63100.0
54  AssocProf          A  25.0       22  Female   62884.0
9        Prof          A  51.0       51    Male   57800.0
28   AsstProf          B   7.0        2    Male       NaN
7        Prof          A  18.0       18    Male       NaN

[78 rows x 6 columns]

In [11]:
df[df.iloc[:,0:3].isnull()]

   rank discipline  phd  service  sex  salary
0   NaN        NaN  NaN      NaN  NaN     NaN
1   NaN        NaN  NaN      NaN  NaN     NaN
2   NaN        NaN  NaN      NaN  NaN     NaN
3   NaN        NaN  NaN      NaN  NaN     NaN
4   NaN        NaN  NaN      NaN  NaN     NaN
..  ...        ...  ...      ...  ...     ...
73  NaN        NaN  NaN      NaN  NaN     NaN
74  NaN        NaN  NaN      NaN  NaN     NaN
75  NaN        NaN  NaN      NaN  NaN     NaN
76  NaN        NaN  NaN      NaN  NaN     NaN
77  NaN        NaN  NaN      NaN  NaN     NaN

[78 rows x 6 columns]

In [12]:
df[df['salary'].isnull()]

        rank discipline   phd  service   sex  salary
7       Prof          A  18.0       18  Male     NaN
28  AsstProf          B   7.0        2  Male     NaN

In [22]:
df.isnull().any(axis=0)                                  # tells which colunm has Nan or notb

rank          False
discipline    False
phd            True
service       False
sex           False
salary         True
dtype: bool

In [21]:
df.isnull().any(axis=0).value_counts()

False    4
True     2
dtype: int64

In [18]:
df.isnull().any(axis=1)                                # gives row has NaN or not

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75    False
76    False
77    False
Length: 78, dtype: bool

In [27]:
df[df['salary'].isnull()]

        rank discipline   phd  service   sex  salary
7       Prof          A  18.0       18  Male     NaN
28  AsstProf          B   7.0        2  Male     NaN

In [44]:
df1 = df.copy()
df1['salary'].dropna()

0     186960.0
1      93000.0
2     110515.0
3     131205.0
4     104800.0
        ...
73    105450.0
74    104542.0
75    124312.0
76    109954.0
77    109646.0
Name: salary, Length: 76, dtype: float64

In [43]:
df['salary']

0     186960.0
1      93000.0
2     110515.0
3     131205.0
4     104800.0
        ...
73    105450.0
74    104542.0
75    124312.0
76    109954.0
77    109646.0
Name: salary, Length: 78, dtype: float64

In [48]:
df1 = df1.fillna(0)
df1[df1['salary']==0]

        rank discipline   phd  service   sex  salary
7       Prof          A  18.0       18  Male     0.0
28  AsstProf          B   7.0        2  Male     0.0

In [11]:
df1 = df.fillna(round(df.mean()))
df1

        rank discipline   phd  service   sex    salary
7       Prof          A  18.0       18  Male  108003.0
28  AsstProf          B   7.0        2  Male  108003.0

In [12]:
df1[df1['salary']==round(df['salary'].mean())]

        rank discipline   phd  service   sex    salary
7       Prof          A  18.0       18  Male  108003.0
28  AsstProf          B   7.0        2  Male  108003.0

In [26]:
df['salary'] = df['salary'].replace('INR','').replace(',','')      # to remove INR and ',' from the salary column 
df['salary']

0     186960.0
1      93000.0
2     110515.0
3     131205.0
4     104800.0
        ...
73    105450.0
74    104542.0
75    124312.0
76    109954.0
77    109646.0
Name: salary, Length: 78, dtype: float64

In [28]:
df['salary'] = pd.to_numeric(df['salary'])                        # to convert salary in numeric form 
df['salary']

0     186960.0
1      93000.0
2     110515.0
3     131205.0
4     104800.0
        ...
73    105450.0
74    104542.0
75    124312.0
76    109954.0
77    109646.0
Name: salary, Length: 78, dtype: float64

In [30]:
df['sex']

0       Male
1       Male
2       Male
3       Male
4       Male
       ...
73    Female
74    Female
75    Female
76    Female
77    Female
Name: sex, Length: 78, dtype: object

In [47]:
df['bool_sex']=df['sex'].map(lambda x:0 if x=='Female' else 1)
df

         rank discipline   phd  service     sex    salary  bool_sex
0        Prof          B  56.0       49    Male  186960.0         1
1        Prof          A  12.0        6    Male   93000.0         1
2        Prof          A  23.0       20    Male  110515.0         1
3        Prof          A  40.0       31    Male  131205.0         1
4        Prof          B  20.0       18    Male  104800.0         1
..        ...        ...   ...      ...     ...       ...       ...
73       Prof          B  18.0       10  Female  105450.0         0
74  AssocProf          B  19.0        6  Female  104542.0         0
75       Prof          B  17.0       17  Female  124312.0         0
76       Prof          A  28.0       14  Female  109954.0         0
77       Prof          A  23.0       15  Female  109646.0         0

[78 rows x 7 columns]

# Analysis of Tiatnic Data

## How many people survived the disaster ?

In [1]:
import pandas as pd
titanic_data = pd.read_csv(r'C:\Users\Yogi\Downloads\training_titanic.csv')
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [71]:
(titanic_data['Survived']==1).value_counts(normalize=True)*100

False    61.616162
True     38.383838
Name: Survived, dtype: float64

In [18]:
a,b=((titanic_data['Sex']=='male') & (titanic_data['Survived']==1)).value_counts(normalize=True)*100
print('Male Died',round(a),'%')
print('Male Survived',round(b),'%')

Male Died 88 %
Male Survived 12 %

In [91]:
t,s=((titanic_data['Sex']=='female') & (titanic_data['Survived']==True)).value_counts(normalize=True)*100
print('Female Survived :',round(t),'%')
print('Female Died',round(s),'%')

Female Survived : 74 %
Female Died 26 %

In [11]:
titanic_data[(titanic_data['Age']<=15) & (titanic_data['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,0,0,330923,8.0292,NaN,Q
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,1,0,2651,11.2417,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.00,1,2,C.A. 34651,27.7500,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
125,126,1,3,"Nicola-Yarred, Master. Elias",male,12.00,1,0,2651,11.2417,NaN,C
165,166,1,3,"Goldsmith, Master. Frank John William ""Frankie""",male,9.00,0,2,363291,20.5250,NaN,S
172,173,1,3,"Johnson, Miss. Eleanor Ileen",female,1.00,1,1,347742,11.1333,NaN,S
183,184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
184,185,1,3,"Kink-Heilmann, Miss. Luise Gretchen",female,4.00,0,2,315153,22.0250,NaN,S
193,194,1,2,"Navratil, Master. Michel M",male,3.00,1,1,230080,26.0000,F2,S
233,234,1,3,"Asplund, Miss. Lillian Gertrud",female,5.00,4,2,347077,31.3875,NaN,S
237,238,1,2,"Collyer, Miss. Marjorie ""Lottie""",female,8.00,0,2,C.A. 31921,26.2500,NaN,S
261,262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,347077,31.3875,NaN,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
348,349,1,3,"Coutts, Master. William Loch ""William""",male,3.00,1,1,C.A. 37671,15.9000,NaN,S
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.00,0,2,2653,15.7417,NaN,C
407,408,1,2,"Richards, Master. William Rowe",male,3.00,1,1,29106,18.7500,NaN,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S
445,446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
446,447,1,2,"Mellinger, Miss. Madeleine Violet",female,13.00,0,1,250644,19.5000,NaN,S
448,449,1,3,"Baclini, Miss. Marie Catherine",female,5.00,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
479,480,1,3,"Hirvonen, Miss. Hildur E",female,2.00,0,1,3101298,12.2875,NaN,S
489,490,1,3,"Coutts, Master. Eden Leslie ""Neville""",male,9.00,1,1,C.A. 37671,15.9000,NaN,S
530,531,1,2,"Quick, Miss. Phyllis May",female,2.00,1,1,26360,26.0000,NaN,S
535,536,1,2,"Hart, Miss. Eva Miriam",female,7.00,0,2,F.C.C. 13529,26.2500,NaN,S
549,550,1,2,"Davies, Master. John Morgan Jr",male,8.00,1,1,C.A. 33112,36.7500,NaN,S
618,619,1,2,"Becker, Miss. Marion Louise",female,4.00,2,1,230136,39.0000,F4,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.00,0,1,24160,211.3375,B5,S
691,692,1,3,"Karun, Miss. Manca",female,4.00,0,1,349256,13.4167,NaN,C
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.00,0,1,248727,33.0000,NaN,S
750,751,1,2,"Wells, Miss. Joan",female,4.00,1,1,29103,23.0000,NaN,S
751,752,1,3,"Moor, Master. Meier",male,6.00,0,1,392096,12.4750,E121,S
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
777,778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.00,0,0,364516,12.4750,NaN,S
780,781,1,3,"Ayoub, Miss. Banoura",female,13.00,0,0,2687,7.2292,NaN,C
788,789,1,3,"Dean, Master. Bertram Vere",male,1.00,1,2,C.A. 2315,20.5750,NaN,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,0,0,2667,7.2250,NaN,C

In [44]:
titanic_data[(titanic_data['Age']<=15) & (titanic_data['Survived']==1)].count()

PassengerId    49
Survived       49
Pclass         49
Name           49
Sex            49
Age            49
SibSp          49
Parch          49
Ticket         49
Fare           49
Cabin          11
Embarked       49
dtype: int64